---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSizeSet.ForwardIterator
source: html/90153833-f363-2234-21fd-c90298033982.htm
---
# Autodesk.Revit.DB.Electrical.WireSizeSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual WireSizeSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.